---
kind: property
id: P:Autodesk.Revit.DB.Steel.SteelElementProperties.IsValidObject
source: html/3f0f9fcb-72f4-a968-a600-25590fc3b0c6.htm
---
# Autodesk.Revit.DB.Steel.SteelElementProperties.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.